//1. Объявите не-статический метод с названием hello. Этот метод не должен ничего принимать, делать или возвращать.
void hello()

//2.Как вывести текст на печать в Java?
System.out.println()

//3. Напишите программу, которая выводит на печать строку "Welcome to Java!". Используйте метод println.
class Main {
    public static void main(String[] args) {
        System.out.println("Welcome to Java!");

    }
}

//4.Заполните пропуски и выведите на печать строку Hello, World!
  class Main {
    public static void main(String[] args) {

    System.out.println("Hello, World!");

    }

}

//5.Как правильно задать однострочный комментарий?
// перед началом комментария

//6. Как правильно оформить комментарий в Java?
/*Поставить // в начале однострочного комментария, конец комментария обозначать не нужно
Поместить комментарий между /* и */
//Поместить комментарий между /** и */

//1. Какой тип переменной нужно использовать, чтобы хранить данные о количестве человек в группе?
int

//2. Доработайте программу так, чтобы она выводила на печать имя, возраст и рост. 
class Man {
    public static void main(String[] args) {
        String name = "Ivan";
        int age = 25;
        double height = 1.85;
        System.out.println(name);
        System.out.println(age);
        System.out.println(height);
    }
}

//3.Присвойте переменной myVar значение 3.1415 и выведите на печать.
class Main {
    public static void main(String[] args) {
        double myVar = 3.1415;
        System.out.print(myVar);
  }
}
