//1. Объявите не-статический метод с названием hello. Этот метод не должен ничего принимать, делать или возвращать.
void hello()

//2.Как вывести текст на печать в Java?
System.out.println()

//3. Напишите программу, которая выводит на печать строку "Welcome to Java!". Используйте метод println.
class Main {
    public static void main(String[] args) {
        System.out.println("Welcome to Java!");

    }
}

//4.Заполните пропуски и выведите на печать строку Hello, World!
  class Main {
    public static void main(String[] args) {

    System.out.println("Hello, World!");

    }

}

//5.Как правильно задать однострочный комментарий?
// перед началом комментария

//6. Как правильно оформить комментарий в Java?
/*Поставить // в начале однострочного комментария, конец комментария обозначать не нужно
Поместить комментарий между /* и */
//Поместить комментарий между /** и */
